# SpecTypeId.Int Class

---
This class contains constants identifying integer specs.
SystemObject Autodesk.Revit.DBSpecTypeIdInt
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class Int

    Public NotInheritable Class Int

    public ref class Int abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type Int = class end
The SpecTypeIdInt type exposes the following members.
| Name| Description
---|---|---
| Integer|  Integer, in discipline Common.
| NumberOfPoles|  Number of Poles, in discipline Electrical.
Top
#### Reference
Autodesk.Revit.DB Namespace